---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterableValueProvider
source: html/37488aad-ce1c-f608-f0cd-ed32c2250656.htm
---
# FilterableValueProvider Methods

Gets a global parameter value associated with a parameter from the given element.